/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "A művelet nem hajtható végre";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Ismeretlen hiba lépett fel (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "A műveletet nem lehet végrehajtani";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Próbálja újra később.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Nem lehet rögzíteni";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Próbálja újra felvenni.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Nem lehet rögzíteni";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Állítson le minden más, a következőt használó műveletet: %@, majd próbálja újra."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Nem lehet rögzíteni";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Próbálja újra felvenni.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Felvétel leállítva";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Próbálja újra felvenni.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Művelet leállítva";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Nincs elég szabad hely a fájl továbbírásához. Szabadítson fel helyet a meglévő videók vagy fotók törlésével.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Felvétel leállítva";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Próbálja újra felvenni.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Felvétel leállítva";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Próbálja újra felvenni.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Felvétel leállítva";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Ez a felvétel elérte a maximális hosszt."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Felvétel leállítva";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Ez a felvétel elérte a maximális méretet."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Felvétel leállítva";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Állítson le minden más, a rögzítőeszközt használó műveletet, majd próbálja újra.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Felvétel leállítva";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Ez a felvétel elérte a maximális hosszt."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Nem lehet rögzíteni";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Próbálja újra felvenni.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "%@ nem használható"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Állítson le minden más, a következőt használó műveletet: %@, majd próbálja újra."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "%@ nem használható"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Állítson le minden más, a következőt használó műveletet: %@, majd próbálja újra."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Felvétel leállítva";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Állítson le minden más, a rögzítőeszközt használó műveletet, majd próbálja újra.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "A műveletet nem lehet végrehajtani";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Próbálja újra később.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Az exportálást nem lehet végrehajtani";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Próbálja újraexportálni.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Nem lehet dekódolni";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "A hordozón található adatok nem dekódolhatók. Előfordulhat, hogy megsérült a hordozó.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Ez a hordozóformátum nem támogatott.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Nem lehet menteni";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Próbálja újra menteni.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "A hordozó nem használható.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "A hordozó nem használható.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "A hordozó nem használható.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "A hordozó nem használható.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Ez a hordozóformátum nem támogatott.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Lehetséges, hogy a hordozó megsérült.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Nem készíthető fotó";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Próbáljon meg újra fotózni.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Művelet leállítva";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Ez a művelet védett tartalmak esetén nem támogatott."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "A tartalom nincs engedélyezve."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Az alkalmazás számára nem engedélyezett a fájl lejátszása."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "A hordozó nem használható.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Nem lehet dekódolni";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Az ehhez az adathordozóhoz szükséges dekóder nem található.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Nem lehet titkosítani";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Az ehhez az adathordozóhoz szükséges titkosító nem található.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Nem lehet dekódolni";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Az ehhez az adathordozóhoz szükséges dekóder foglalt.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Állítson le minden más, a hordozót dekódoló műveletet, majd próbálja újra.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Nem lehet titkosítani";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Az ehhez az adathordozóhoz szükséges titkosító foglalt.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Állítson le minden más, médiát titkosító műveletet, majd próbálja újra.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "%@ nem használható"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "A(z) %@ nem használható egy háttérben futó alkalmazással."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Művelet leállítva";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Ez a művelet ezen hordozó esetén nem támogatott.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Művelet leállítva";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Ez a videó a mellékelt utasítások szerint nem hozható létre.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Nem lehet megnyitni";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "A hordozó nem használható.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Művelet leállítva";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "A letöltési cél-URL-nél található gyorsítótárfájl nem használható.";
